{
    "format": "graph-model",
    "generatedBy": "2.19.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "signature": {
        "inputs": {
            "input_layer_2": {
                "name": "input_layer_2:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "48"
                        },
                        {
                            "size": "48"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "output_0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "7"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_9_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_9_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_10_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_10_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_11_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_11_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_12_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_12_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_12_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_12_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_13_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_13_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_13_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_13_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_14_1/convolution/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_14_1/Squeeze",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_14_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_14_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/flatten_3_1/strided_slice/stack",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/flatten_3_1/strided_slice/stack_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/flatten_3_1/strided_slice/stack_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/flatten_3_1/Reshape/shape/1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_13_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3200"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_13_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_15_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_15_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_14_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_14_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_16_1/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_16_1/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_15_1/Cast/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "7"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/dense_15_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "7"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "input_layer_2",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "48"
                                },
                                {
                                    "size": "48"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_9_1/BiasAdd",
                "op": "_FusedConv2D",
                "input": [
                    "input_layer_2",
                    "StatefulPartitionedCall/sequential_1/conv2d_9_1/convolution/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_1/conv2d_9_1/Squeeze"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_host_args": {
                        "i": "0"
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "filter_format": {
                        "s": "SFdJTw=="
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "TArgs": {
                        "list": {
                            "type": [
                                "DT_FLOAT"
                            ]
                        }
                    },
                    "padding": {
                        "s": "VkFMSUQ="
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_1/conv2d_9_1/BiasAdd",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/mul_1",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/leaky_re_lu_1/LeakyRelu",
                "op": "LeakyRelu",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_9_1/batchnorm/add_1"
                ],
                "attr": {
                    "alpha": {
                        "f": 0.1
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_10_1/BiasAdd",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/sequential_1/leaky_re_lu_1/LeakyRelu",
                    "StatefulPartitionedCall/sequential_1/conv2d_10_1/convolution/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_1/conv2d_10_1/Squeeze"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_host_args": {
                        "i": "0"
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "filter_format": {
                        "s": "SFdJTw=="
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "TArgs": {
                        "list": {
                            "type": [
                                "DT_FLOAT"
                            ]
                        }
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_1/conv2d_10_1/BiasAdd",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/mul_1",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/leaky_re_lu_1_2/LeakyRelu",
                "op": "LeakyRelu",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_10_1/batchnorm/add_1"
                ],
                "attr": {
                    "alpha": {
                        "f": 0.1
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_6_1/MaxPool2d",
                "op": "MaxPool",
                "input": [
                    "StatefulPartitionedCall/sequential_1/leaky_re_lu_1_2/LeakyRelu"
                ],
                "attr": {
                    "padding": {
                        "s": "VkFMSUQ="
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "ksize": {
                        "list": {
                            "i": [
                                "1",
                                "2",
                                "2",
                                "1"
                            ]
                        }
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "2",
                                "2",
                                "1"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_11_1/BiasAdd",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/sequential_1/max_pooling2d_6_1/MaxPool2d",
                    "StatefulPartitionedCall/sequential_1/conv2d_11_1/convolution/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_1/conv2d_11_1/Squeeze"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_host_args": {
                        "i": "0"
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "filter_format": {
                        "s": "SFdJTw=="
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "TArgs": {
                        "list": {
                            "type": [
                                "DT_FLOAT"
                            ]
                        }
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_1/conv2d_11_1/BiasAdd",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/mul_1",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/leaky_re_lu_2_1/LeakyRelu",
                "op": "LeakyRelu",
                "input": [
                    "StatefulPartitionedCall/sequential_1/batch_normalization_11_1/batchnorm/add_1"
                ],
                "attr": {
                    "alpha": {
                        "f": 0.1
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/conv2d_12_1/BiasAdd",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/sequential_1/leaky_re_lu_2_1/LeakyRelu",
                    "StatefulPartitionedCall/sequential_1/conv2d_12_1/convolution/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_1/conv2d_12_1/Squeeze"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_host_args": {
                        "i": "0"
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "filter_format": {
                        "s": "SFdJTw=="
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "TArgs": {
                        "list": {
                            "type": [
                                "DT_FLOAT"
                            ]
                        }
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_1/batch_normalization_12_1/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/sequential_1/conv2d_12_1/BiasAdd",
                    "StatefulPartitionedCall/sequential_1/batch_normalization_12_1/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
